app/controllers/predictions_controller.rb

  def show
    @prediction = Prediction.find(params[:id])
---
SELECT "predictions".* FROM "predictions" WHERE "predictions"."id" = $1 LIMIT $2  [["id", 100], ["LIMIT", 1]]

      @prediction.errors.add(:base, "Não foi possível calcular a previsão agora; tente novamente mais tarde.")
      render :new, status: :unprocessable_entity

    elsif @prediction.save
---
INSERT INTO "predictions" ("height", "weight", "prediction", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["height", "69.0"], ["weight", "200.0"], ["prediction", 1], ["created_at", "2025-05-24 01:40:35.115490"], ["updated_at", "2025-05-24 01:40:35.115490"]]